import random
""" lists = [10, 20, 30, 40, 50, 60, 70, 80]
count = 360
gifts = ['感谢参与 ', '盲盒 ', 'R汽车 定制环保袋 ', '冰淇淋',
         'R汽车 定制扇子 ', '免费上门试驾服务 ', '半夏 键盘套装 ', '周杰伦 签名照 ']
for k, v in enumerate(lists):
    avg = (v / count) * 100
    for index, value in enumerate(gifts):
        if (k == index):
            print('总抽奖人数为:%d ,抽中type为%s的次数为:%d,中奖概率为:%.2f%%' %
                  (count, value, v, avg)) """


"""
总抽奖人数为:360 ,抽中type为感谢参与 的次数为:10,中奖概率为:2.78%
总抽奖人数为:360 ,抽中type为盲盒 的次数为:20,中奖概率为:5.56%
总抽奖人数为:360 ,抽中type为R汽车 定制环保袋 的次数为:30,中奖概率为:8.33%
总抽奖人数为:360 ,抽中type为冰淇淋的次数为:40,中奖概率为:11.11%
总抽奖人数为:360 ,抽中type为R汽车 定制扇子 的次数为:50,中奖概率为:13.89%
总抽奖人数为:360 ,抽中type为免费上门试驾服务 的次数为:60,中奖概率为:16.67%
总抽奖人数为:360 ,抽中type为半夏 键盘套装 的次数为:70,中奖概率为:19.44%
总抽奖人数为:360 ,抽中type为周杰伦 签名照 的次数为:80,中奖概率为:22.22%
 """

t1 = list(range(1, 9))
t2 = [0] * 3
#print(dict(zip(t1, t2)))
#{1: 0, 2: 0, 3: 0, 4: 0, 5: 0, 6: 0, 7: 0, 8: 0}
z = list(zip(t1, t2))
# print(list(zip(*z)))
l = [1, 2, 3, 4, 5]
m = ['a', 'b', 'c', 'd', 'f']


def sum(i, m):
    return str(i) + m


# print(map(sum, l))
print(list(map(sum, l, m)))
